NACA0012UnsteadyComp/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|p_rgh|G)"
    {
        solver           GAMG;
        tolerance        0;
        relTol           0.01;
        smoother         GaussSeidel;
        maxIter          100;
        minIter          1;
    }

    "(p|p_rgh|G)Final"
    {
        $p;
        relTol          0;
        tolerance       1e-8;
    }

    "(U|T|e|h|nuTilda|k|omega|epsilon|rho)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.0;
        maxIter         100;
        minIter          1;
    }

    "(U|T|e|h|nuTilda|k|omega|epsilon|rho)Final"
    {
        $U;
        relTol          0;
    }
}

relaxationFactors
{
    fields
    {
      "(p|p_rgh|G)"                   0.3;
      // rho  0.3;
    }
    equations
    {
       "(U|T|e|h|nuTilda|k|omega|epsilon)"      0.7;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
    nOuterCorrectors 100;

    residualControl
    {
        "(U|T|e|h|nuTilda|k|omega|epsilon|p|p_rgh|G|rho)" 
        {
            tolerance       1e-8; 
            relTol          1e-8; 
        } 
    }
}



// ************************************************************************* //
